models/AdForm.php

SELECT * FROM `Region` ORDER BY `Name`
SELECT * FROM `Mark` ORDER BY `Name`
SELECT * FROM `EngineCapacity` ORDER BY `Value`
SELECT * FROM `NumberHosts` ORDER BY `Value`
SELECT * FROM `Mileage` ORDER BY `Value`
---
    public function LoadData()
    {
        // Вносим все данные в текущую модель
        $this->Region = Region::find()->orderBy('Name')->all();
        $this->Mark = Mark::find()->orderBy('Name')->all();
        $this->EngineCapacity = EngineCapacity::find()->orderBy('Value')->all();
        $this->NumberHosts = NumberHosts::find()->orderBy('Value')->all();
        $this->Mileage = Mileage::find()->orderBy('Value')->all();

SELECT * FROM `User` WHERE `id`=24
---
    public function LimitIsExceeded()
    {
        $userData = User::findOne(Yii::$app->user->id);

INSERT INTO `Images` (`Url`, `IdAd`) VALUES ('14649045295750ab512fb92.jpg', 175)
---
    public function AddData()
    {
        if ($this->validate()) {    // Валидируем данные
            $arrSaveImages = $this->upload();   // Сохраняем картинки и получаем данные о местоположении
            $ad = new Ad();

            $transaction = Ad::getDb()->beginTransaction(); // Открываем транзакцию в модели обьявления
            try {

                // Вносим данные
                $ad->City = $this->City;
                $ad->Model = $this->Model;
                $ad->EngineCapacity = $this->EngineCapacity;
                $ad->NumberHosts = $this->NumberHosts;
                $ad->Mileage = $this->Mileage;
                $ad->DateTime = date("Y-m-d H:i:s");
                $ad->IdUser = Yii::$app->user->id;

                if($ad->save()) // Сохраняем, если строка была добавлена, то добавляем и картинки
                {
                    foreach($this->Images as $file) // Проходимся по всем картинкам
                    {
                        $images = new Images();
                        $images->Url = $arrSaveImages["InsertBD"][$file->baseName]; // Вносим урл
                        $images->IdAd = $ad->Id;    // Айди обьявления
                        if(!$images->save())    // Сохраняем данные

SELECT `Id`, `Name` FROM `City` WHERE `IdRegion`='4' ORDER BY `Name`
---
    public function GetCity()
    {
        return City::find()->select(['Id', 'Name'])->where(['IdRegion' => $this->Region])->orderBy('Name')->all();

SELECT `Id`, `Name` FROM `Model` WHERE `IdMark`='6' ORDER BY `Name`
---
    public function GetModel()
    {
        return \app\models\Model::find()->select(['Id', 'Name'])->where(['IdMark' => $this->Mark])->orderBy('Name')->all();