models/FilterForm.php

    public function LoadData($params){
        $this->load($params);   // Загружаем данные в модель - это нужно для фильтра
        $query = Ad::find();

        if($this->validate())   // Делаем валидацию
        {
            $arrCity = $arrModel = [];  // Создаем массив для городов

            if($this->City) // Если город был выбран
                $arrCity = $this->City; // то записываем его

            if($this->Model)    // Если была выбрана модель
                $arrModel = $this->Model; // то записываем её

            if($this->Region && !$this->City)   // Если был выбран регион, но не выбран город
            {
                $city = City::find()->where([ 'IdRegion' => $this->Region ])->asArray()->all(); // Выбираем все города по региону
                foreach($city as $value)    // Прокручиваем города и вносим в единый миссив с айдихами
                    array_push($arrCity, $value['Id']);
            }

            if($this->Mark && !$this->Model) // Если была выбрана марка, но не выбрана модель
            {
                $model = \app\models\Model::find()->where([ 'IdMark' => $this->Mark ])->asArray()->all(); // Выбираем все модели по марке
---
SELECT * FROM `City` WHERE `IdRegion`='3'
SELECT * FROM `Model` WHERE `IdMark`='4'